# 20191221 Data Visualization Workshop Tutorial

## Pythonの基本的な操作方法について、手を動かしながら学んでいきましょう！

このNotebookでは、Pythonでデータ分析する際の基礎的な部分について解説をしています。是非一度目を通していただけると良いと思います。

Slack上にて質問等承ります！

## 0. 必要なライブラリを読み込みます。

Pythonでコードを書くうえで、事前にライブラリを読み込む必要があります。
このチュートリアルでは、Pandasというライブラリを使用します。このライブラリを使うことで、データの抽出・集計・加工といったデータ解析を行うことが出来ます。

In [12]:
# pandasを読み込んでください。pandasを使う時は、pdと略して (as) 使います。
import pandas as pd

/Users/k.fukada/.local/share/virtualenvs/data_science-tXjswaqR/lib/python3.8/site-packages/pandas/compat/__init__.py:117: UserWarning: Could not import the lzma module. Your installed Python is incomplete. Attempting to use lzma compression will result in a RuntimeError.
  warnings.warn(msg)

## 1. データをnotebook上で取り扱う準備をする。

## 1.1. データを読み込む

ダウンロードしたcsvファイルをJupyter notebook上にアップロードしてください！
（JupyterNotebookを開いて、最初に出てくる画面に"Upload"というタブがあるので、クリックしてください。）

In [14]:
# csvファイルを読み込んで、dfという箱に格納する。ここでは、"df"と名前を付けていますが、なんでも大丈夫です。
df = pd.read_csv('./data/20191221_Tutorial_data.csv')

## 1.2. データを見てみる

読み込んだデータを表示してみましょう！

In [15]:
df

        ID  Age     Sex   Address  Frequency
0        1   25    Male  Kyuusyuu          1
1        2   21  Female  Hokkaido          1
2        3   21  Female  Hokkaido          1
3        4   46  Female  Kyuusyuu          2
4        5   53    Male  Tyuugoku          4
...    ...  ...     ...       ...        ...
1216  1217   38  Female     Tyubu          1
1217  1218   35  Female  Hokkaido          1
1218  1219   53    Male     Kanto          1
1219  1220   32  Female     Kanto          1
1220  1221   63  Female  Kyuusyuu          5

[1221 rows x 5 columns]

データの意味
- ID: 顧客に付与されているID
- Age: 年齢
- Sex: 性別
- Address: 住所。県レベル。
- Frequency: 購入回数

ちらっとデータを確認することも出来ます！

In [16]:
# 最初の5行だけ表示する。()に数字を入れると、その行分表示される。
df.head()

   ID  Age     Sex   Address  Frequency
0   1   25    Male  Kyuusyuu          1
1   2   21  Female  Hokkaido          1
2   3   21  Female  Hokkaido          1
3   4   46  Female  Kyuusyuu          2
4   5   53    Male  Tyuugoku          4

In [17]:
# 最後の5行だけ表示する。
df.tail()

        ID  Age     Sex   Address  Frequency
1216  1217   38  Female     Tyubu          1
1217  1218   35  Female  Hokkaido          1
1218  1219   53    Male     Kanto          1
1219  1220   32  Female     Kanto          1
1220  1221   63  Female  Kyuusyuu          5

## 1.3. データフレームとは？
データフレームとは表形式のデータのことで、Pythonでよく使われるデータ構造です。
- index：行のラベルを表します。今回のデータだと、0, 1, 2, 3...に相当します。(注意) Pythonは、0から始まります。
- columns：列のラベルを表します。今回のデータだと、に相当します。

In [18]:
# 実際にindexを見てみる。
df.index

RangeIndex(start=0, stop=1221, step=1)

In [20]:
# 実際にcolumnsを見てみる。
df.columns

Index(['ID', 'Age', 'Sex', 'Address', 'Frequency'], dtype='object')

## 1.4. データにどんな値が入っているかを確認する。

どんなデータかをざっくり把握する時には .info()を使用する。

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1221 entries, 0 to 1220
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         1221 non-null   int64
 1   Age        1221 non-null   int64
 2   Sex        1221 non-null   object
 3   Address    1221 non-null   object
 4   Frequency  1221 non-null   int64
dtypes: int64(3), object(2)
memory usage: 47.8+ KB

- RangeIndex: Indexについての表示。このデータでは、0~1220までのIndexがある。
- Data columns: columnsについての表示。このデータでは、ID, Age, Sex, Address, Frequencyという5つのcolumnsがある。
- non-null: 欠損している値はないということ。
- int64: データに入っている値の形を表す。int64は数値であることを示している。
- object64: 文字情報であることを示している。

## 2. データを抽出してみる。

この章では、indexやcolumns（つまり、行や列）を指定して、データを抜き取ってみましょう！

## 2.1. 行を指定して抽出

行を指定する場合は、.loc[]関数を使用する。

In [22]:
# 50行目のデータを抽出したい。
df.loc[49]

ID                 50
Age                22
Sex            Female
Address      Kyuusyuu
Frequency           2
Name: 49, dtype: object

In [23]:
# 50行目から60行目のデータを抽出したい。
df.loc[49:59]

    ID  Age     Sex   Address  Frequency
49  50   22  Female  Kyuusyuu          2
50  51   32  Female     Kanto          1
51  52   37    Male  Kyuusyuu          1
52  53   29  Female  Hokkaido          2
53  54   24  Female    Tohoku          1
54  55   38    Male  Kyuusyuu          1
55  56   36  Female  Kyuusyuu          1
56  57   41  Female     Kanto          1
57  58   52  Female  Kyuusyuu          4
58  59   61  Female     Kinki          1
59  60   67  Female  Hokkaido          3

## 2.2. 列を指定してデータを抽出する。

データフレーム名.列名 とすることで、抽出出来る。

In [24]:
# Ageという列のデータを抽出する。
df.Age

0       25
1       21
2       21
3       46
4       53
        ..
1216    38
1217    35
1218    53
1219    32
1220    63
Name: Age, Length: 1221, dtype: int64

In [26]:
df.head()

   ID  Age     Sex   Address  Frequency
0   1   25    Male  Kyuusyuu          1
1   2   21  Female  Hokkaido          1
2   3   21  Female  Hokkaido          1
3   4   46  Female  Kyuusyuu          2
4   5   53    Male  Tyuugoku          4

In [27]:
# こちらのやり方もある。
df['Age']

0       25
1       21
2       21
3       46
4       53
        ..
1216    38
1217    35
1218    53
1219    32
1220    63
Name: Age, Length: 1221, dtype: int64

複数列を指定する際は、loc[]関数を用いる。

In [28]:
# Age, Sexという複数列のデータを抽出する。:は行の全てを指定している。
df.loc[:,['Age','Sex']]

      Age     Sex
0      25    Male
1      21  Female
2      21  Female
3      46  Female
4      53    Male
...   ...     ...
1216   38  Female
1217   35  Female
1218   53    Male
1219   32  Female
1220   63  Female

[1221 rows x 2 columns]

## 3. データを集計してみる。

データフレーム名.集計方法 とすることで、集計出来る。。

## 3.1. 合計値を出してみる。

合計値を出す時は、.sum()を使用する。

In [30]:
df.head()

   ID  Age     Sex   Address  Frequency
0   1   25    Male  Kyuusyuu          1
1   2   21  Female  Hokkaido          1
2   3   21  Female  Hokkaido          1
3   4   46  Female  Kyuusyuu          2
4   5   53    Male  Tyuugoku          4

In [29]:
df.sum()

ID                                                      746031
Age                                                      44810
Sex          MaleFemaleFemaleFemaleMaleFemaleMaleFemaleFema...
Address      KyuusyuuHokkaidoHokkaidoKyuusyuuTyuugokuTyubuK...
Frequency                                                 2189
dtype: object

- int64のカラムのデータしか合計は出ない
- objectのカラムだと文字情報をただくっつけただけになる

## 3.2. 平均を出してみる。

合計値を出す時は、.mean()を使用する。

In [31]:
df.mean()

ID           611.000000
Age           36.699427
Frequency      1.792793
dtype: float64

In [32]:
df.Age.mean()

36.6994266994267

- int64のカラムのデータしか平均は出ない（文字情報で平均は出せない）

## 3.3. データの個数を出してみる。

.count()を使用する。

In [33]:
df.count()

ID           1221
Age          1221
Sex          1221
Address      1221
Frequency    1221
dtype: int64

## 4. データを抽出して、集計してみる。

年齢のデータを抽出して、平均値を出してみましょう！

【練習】購入回数のデータを抽出して、平均値を出してみましょう！

## 5 可視化

In [34]:
df.head()

   ID  Age     Sex   Address  Frequency
0   1   25    Male  Kyuusyuu          1
1   2   21  Female  Hokkaido          1
2   3   21  Female  Hokkaido          1
3   4   46  Female  Kyuusyuu          2
4   5   53    Male  Tyuugoku          4

In [35]:
import seaborn as sns

In [ ]:
sns.countplot(df['Age'], hue=df['Sex'])